const sysMsg = {
    // Error message
    E001: 'このフィールドは必須です。',
    E002: 'メールアドレスのを正しい形式で入力してください。',
    E003: '電話番号のを正しい形式で入力してください。',
    E004: '郵便番号のを正しい形式で入力してください。',
    E005: 'カタカナ文字のみ使用できます。',
    E006: 'この値は{0}より大きくなければなりません。',
    E007: 'この値は{0}未満である必要があります。',

    // Confirm message

    // Success message

    // API error
    E400: 'エラーが発生しました。もう一度お願いします。',
    E401: 'ログインセッションの有効期限が切れています。<br/>もう一度ログインしてください。',
    E403: 'この機能にアクセスする権限がありません。',
    E404: 'エラーが発生しました。もう一度お願いします。',
    E422: 'エラーが発生しました。もう一度お願いします。',
    E423: 'エラーが発生しました。もう一度お願いします。',
    E500: 'エラーが発生しました。もう一度お願いします。',
    E999: 'エラーが発生しました。もう一度お願いします。'
}

const msgTitle = {
    E999: 'エラー'
}

const msgType = {
    CONFIRM: 'CONFIRM',
    WARNING: 'WARNING',
    SUCCESS: 'SUCCESS',
    ERROR: 'ERROR'
}
